[
    {
        "name": "Applied Machine Learning",
        "courseCode": "COMP 551",
        "description": "Topics in machine learning and data mining, including clustering, neural networks, support vector machines, decision trees. Methods include feature selection and dimensionality reduction, error estimation and empirical validation, algorithm design and parallelization, and handling of large data sets. Emphasis on good methods and practices for deployment of real systems.",
        "technologies": "Python, Jupyter Notebook, Numpy, Pandas, Scikit-learn, Matplotlib, Seaborn, Tensorflow, Keras, Pytorch"
    },
    {
        "name": "Reinforcement Learning",
        "courseCode": "COMP 579",
        "description": "Bandit algorithms, Finite Markov decision processes, dynamic programming, Monte-Carlo Methods, temporal-difference learning, bootstrapping, planning, approximation methods, on versus off policy learning, policy gradient methods temporal abstraction and inverse reinforcement learning.",
        "technologies": "Python"
    },
    {
        "name": "Software Design",
        "courseCode": "COMP 303",
        "description": "Principles, mechanisms, techniques, and tools for object-oriented software design and its implementation, including encapsulation, design patterns, and unit testing.",
        "technologies": "Java, JUnit, Git"
    },
    {
        "name": "Algorithms and Data Structures",
        "courseCode": "COMP 251",
        "description": "Algorithm design and analysis. Graph algorithms, greedy algorithms, data structures, dynamic programming, maximum flows.",
        "technologies": "Java"
    },
    {
        "name": "Database Systems",
        "courseCode": "COMP 421",
        "description": "Database Design: conceptual design of databases (e.g., entity-relationship model), relational data model, functional dependencies. Database Manipulation: relational algebra, SQL, database application programming, triggers, access control. Database Implementation: transactions, concurrency control, recovery, query execution and query optimization.",
        "technologies": "Java, SQL, Hadoop, Pig Latin, PostgreSQL, MySQL"
    },
    {
        "name": "Robotics and Intelligent Systems",
        "courseCode": "COMP 417",
        "description": "This course considers issues relevant to the design of robotic and of intelligent systems. How can robots move and interact. Robotic hardware systems. Kinematics and inverse kinematics. Sensors, sensor data interpretation and sensor fusion. Path planning. Configuration spaces. Position estimation. Intelligent systems. Spatial mapping. Multi-agent systems. Applications.",
        "technologies": "Python, OpenCV"
    }

]